In [8]:
import pandas as pd
import numpy as np

df = pd.read_csv(r"C:\Users\Soham Gon\Desktop\blinkit analysis\Data\csv\blinkit_customers.csv")

df.head()

,customer_id,customer_name,email,phone,address,area,pincode,registration_date,customer_segment,total_orders,avg_order_value
0,97475543,Niharika Nagi,ektataneja@example.org,912987579691,"23, Nayar Path, Bihar Sharif-154625",Udupi,321865,2023-05-13,Premium,13,451.92
1,22077605,Megha Sachar,vedant45@example.com,915123179717,"51/302, Buch Chowk\nSrinagar-570271",Aligarh,149394,2024-06-18,Inactive,4,825.48
2,47822591,Hema Bahri,samiazaan@example.com,910034076149,"941\nAnne Street, Darbhanga 186125",Begusarai,621411,2024-09-25,Regular,17,1969.81
3,79726146,Zaitra Vig,ishanvi87@example.org,916264232390,"43/94, Ghosh, Alappuzha 635655",Kozhikode,826054,2023-10-04,New,4,220.09
4,57102800,Januja Verma,atideshpande@example.org,917293526596,"06\nOm, Ambarnath 477463",Ichalkaranji,730539,2024-03-22,Inactive,14,578.14

In [12]:
df['registration_date'] = pd.to_datetime(df['registration_date'], format = '%Y-%m-%d')

df['registration_year'] = df['registration_date'].dt.year

yearly_regt_count = (
    df.groupby('registration_year', as_index=False).agg(
        total_count = ('customer_id', 'count')
    )
)

yearly_regt_count['regt_share'] = (yearly_regt_count['total_count'] / yearly_regt_count['total_count'].sum()) * 100
yearly_regt_count

   registration_year  total_count  regt_share
0               2023         1163       46.52
1               2024         1337       53.48

In [13]:
df.head()

,customer_id,customer_name,email,phone,address,area,pincode,registration_date,customer_segment,total_orders,avg_order_value,registration_year
0,97475543,Niharika Nagi,ektataneja@example.org,912987579691,"23, Nayar Path, Bihar Sharif-154625",Udupi,321865,2023-05-13,Premium,13,451.92,2023
1,22077605,Megha Sachar,vedant45@example.com,915123179717,"51/302, Buch Chowk\nSrinagar-570271",Aligarh,149394,2024-06-18,Inactive,4,825.48,2024
2,47822591,Hema Bahri,samiazaan@example.com,910034076149,"941\nAnne Street, Darbhanga 186125",Begusarai,621411,2024-09-25,Regular,17,1969.81,2024
3,79726146,Zaitra Vig,ishanvi87@example.org,916264232390,"43/94, Ghosh, Alappuzha 635655",Kozhikode,826054,2023-10-04,New,4,220.09,2023
4,57102800,Januja Verma,atideshpande@example.org,917293526596,"06\nOm, Ambarnath 477463",Ichalkaranji,730539,2024-03-22,Inactive,14,578.14,2024

In [14]:
df['registration_month'] = df['registration_date'].dt.month

In [15]:
df.to_csv(r"C:\Users\Soham Gon\Desktop\blinkit analysis\Data\cleaned\blinkit_customers_cleaned.csv", index=False)
print("saved in csv format!")

saved in csv format!